spec/cassettes/charges/incorrect_cvc.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[name]=Lauriane%20Stark&card[number]=4000000000000127&card[exp_month]=11&card[exp_year]=2016&card[cvc]=284&card[address_line1]=3844%20Ceasar%20Roads&card[address_city]=New%20Jordistad&card[address_state]=MS&card[address_zip]=70736-0714
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_DG9jhMEC44K3GkcAvgq6X37L
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-07-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Grants-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Grants-MBP"}'
      Content-Length:
      - '239'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 13 Jul 2015 21:28:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '841'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6bRM0FhYaPoWPt
      Stripe-Version:
      - '2015-07-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16OEThCKrsNpguPAaWGX96EN",
          "livemode": false,
          "created": 1436822925,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16OEThCKrsNpguPAKCRKW7rr",
            "object": "card",
            "last4": "0127",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 11,
            "exp_year": 2016,
            "fingerprint": "XMgkTuILB2ctbYwY",
            "country": "US",
            "name": "Lauriane Stark",
            "address_line1": "3844 Ceasar Roads",
            "address_line2": null,
            "address_city": "New Jordistad",
            "address_state": "MS",
            "address_zip": "70736-0714",
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": "unchecked",
            "address_zip_check": "unchecked",
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "73.181.33.156"
        }
    http_version: 
  recorded_at: Mon, 13 Jul 2015 21:28:46 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=100&card=tok_16OEThCKrsNpguPAaWGX96EN&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_DG9jhMEC44K3GkcAvgq6X37L
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-07-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Grants-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Grants-MBP"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Mon, 13 Jul 2015 21:28:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '198'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6bRMNPrqTnTG0F
      Stripe-Version:
      - '2015-07-07'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card's security code is incorrect.",
            "type": "card_error",
            "param": "cvc",
            "code": "incorrect_cvc",
            "charge": "ch_16OETiCKrsNpguPAKymF3H6M"
          }
        }
    http_version: 
  recorded_at: Mon, 13 Jul 2015 21:28:46 GMT
recorded_with: VCR 2.9.3
