spec/cassettes/charges/incorrect_zip.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[name]=Mr.%20Marcellus%20O'Keefe&card[number]=4000000000000036&card[exp_month]=1&card[exp_year]=2016&card[cvc]=702&card[address_line1]=1476%20Lehner%20Shore&card[address_city]=Cordieborough&card[address_state]=IA&card[address_zip]=97090-6664
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_DG9jhMEC44K3GkcAvgq6X37L
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-07-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Grants-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Grants-MBP"}'
      Content-Length:
      - '245'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 13 Jul 2015 21:54:39 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '847'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6bRmAChmXw8ca4
      Stripe-Version:
      - '2015-07-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16OEslCKrsNpguPANcP17x9P",
          "livemode": false,
          "created": 1436824479,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16OEslCKrsNpguPAMIGDNtFJ",
            "object": "card",
            "last4": "0036",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 1,
            "exp_year": 2016,
            "fingerprint": "vRav38pFbjGmYKjs",
            "country": "US",
            "name": "Mr. Marcellus O'Keefe",
            "address_line1": "1476 Lehner Shore",
            "address_line2": null,
            "address_city": "Cordieborough",
            "address_state": "IA",
            "address_zip": "97090-6664",
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": "unchecked",
            "address_zip_check": "unchecked",
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "73.181.33.156"
        }
    http_version: 
  recorded_at: Mon, 13 Jul 2015 21:54:39 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=100&card=tok_16OEslCKrsNpguPANcP17x9P&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_DG9jhMEC44K3GkcAvgq6X37L
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-07-07'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Grants-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Grants-MBP"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Mon, 13 Jul 2015 21:54:39 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '211'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6bRmENA4jrYRvM
      Stripe-Version:
      - '2015-07-07'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "The zip code you supplied failed validation.",
            "type": "card_error",
            "param": "address_zip",
            "code": "incorrect_zip",
            "charge": "ch_16OEslCKrsNpguPAQ4PJOKGH"
          }
        }
    http_version: 
  recorded_at: Mon, 13 Jul 2015 21:54:39 GMT
recorded_with: VCR 2.9.3
