spec/cassettes/charges/successful.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[name]=Mustafa%20McLaughlin%20Jr.&card[number]=4242424242424242&card[exp_month]=2&card[exp_year]=2016&card[cvc]=490&card[address_line1]=1339%20Reynolds%20Pike&card[address_city]=Hermanborough&card[address_state]=AL&card[address_zip]=34553
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_DG9jhMEC44K3GkcAvgq6X37L
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Grants-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Grants-MBP"}'
      Content-Length:
      - '242'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 13 Jul 2015 19:53:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '845'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6bPpLF8yU3FkKv
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16OCzUCKrsNpguPAcIlJQlC9",
          "livemode": false,
          "created": 1436817208,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16OCzUCKrsNpguPAztOOnYoj",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 2,
            "exp_year": 2016,
            "fingerprint": "CeRwsPRc2GkYiXsO",
            "country": "US",
            "name": "Mustafa McLaughlin Jr.",
            "address_line1": "1339 Reynolds Pike",
            "address_line2": null,
            "address_city": "Hermanborough",
            "address_state": "AL",
            "address_zip": "34553",
            "address_country": null,
            "cvc_check": null,
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": null
          },
          "client_ip": "73.181.33.156"
        }
    http_version: 
  recorded_at: Mon, 13 Jul 2015 19:53:28 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=100&card=tok_16OCzUCKrsNpguPAcIlJQlC9&currency=usd
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.23.0
      Authorization:
      - Bearer sk_test_DG9jhMEC44K3GkcAvgq6X37L
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.23.0","lang":"ruby","lang_version":"2.2.2 p95 (2015-04-13)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Grants-MBP 14.4.0 Darwin Kernel Version 14.4.0: Thu May 28 11:35:04 PDT 2015;
        root:xnu-2782.30.5~1/RELEASE_X86_64 x86_64","hostname":"Grants-MBP"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 13 Jul 2015 19:53:28 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2179'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6bPpzNLuEebafZ
      Stripe-Version:
      - '2014-11-05'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_16OCzUCKrsNpguPAuiYCPKRV",
          "object": "charge",
          "created": 1436817208,
          "livemode": false,
          "paid": true,
          "status": "paid",
          "amount": 100,
          "currency": "usd",
          "refunded": false,
          "source": {
            "id": "card_16OCzUCKrsNpguPAztOOnYoj",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 2,
            "exp_year": 2016,
            "fingerprint": "CeRwsPRc2GkYiXsO",
            "country": "US",
            "name": "Mustafa McLaughlin Jr.",
            "address_line1": "1339 Reynolds Pike",
            "address_line2": null,
            "address_city": "Hermanborough",
            "address_state": "AL",
            "address_zip": "34553",
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": "pass",
            "address_zip_check": "pass",
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": null
          },
          "captured": true,
          "card": {
            "id": "card_16OCzUCKrsNpguPAztOOnYoj",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 2,
            "exp_year": 2016,
            "fingerprint": "CeRwsPRc2GkYiXsO",
            "country": "US",
            "name": "Mustafa McLaughlin Jr.",
            "address_line1": "1339 Reynolds Pike",
            "address_line2": null,
            "address_city": "Hermanborough",
            "address_state": "AL",
            "address_zip": "34553",
            "address_country": null,
            "cvc_check": "pass",
            "address_line1_check": "pass",
            "address_zip_check": "pass",
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {},
            "customer": null
          },
          "balance_transaction": "txn_16OCzUCKrsNpguPAi9Sdo1fY",
          "failure_message": null,
          "failure_code": null,
          "amount_refunded": 0,
          "customer": null,
          "invoice": null,
          "description": null,
          "dispute": null,
          "metadata": {},
          "statement_descriptor": null,
          "fraud_details": {},
          "receipt_email": null,
          "receipt_number": null,
          "shipping": null,
          "destination": null,
          "application_fee": null,
          "refunds": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/charges/ch_16OCzUCKrsNpguPAuiYCPKRV/refunds",
            "data": []
          },
          "statement_description": null
        }
    http_version: 
  recorded_at: Mon, 13 Jul 2015 19:53:29 GMT
recorded_with: VCR 2.9.3
